api/actions/AboutAction.php

SELECT * FROM `about` WHERE `status`='1'
---
    public static function getList(){
           return About::find()
               ->where(['status' => '1'])
               ->all();